# 1 завдання





імя = input("Як тебе звати? ")
вік = input("Скільки тобі років? ")

print(f"Привіт {імя}, тобі {вік}!")





# 2 завдання





вік = int(input("Скільки тобі років? "))

if вік > 18:
    print("Вхід дозволено!")
else:
    print("Вхід заборонено!")






# 3 завдання








import random

загадане = random.randint(1, 10)

for спроба in range(3):
    число = int(input("Вгадай число від 1 до 10: "))

    if число == загадане:
        print("Вітаю, ти вгадав!")
        break
    elif число > загадане:
        print("Менше")
    else:
        print("Більше")
else:
    print(f"Спроби закінчилися. Було загадано число {загадане}.")











#4 завдання






початок = int(input("Введи перше число: "))
кінець = int(input("Введи друге число: "))

for число in range(початок, кінець + 1):
    print(число)







#5  завдання






n = int(input("Введи число n: "))

for число in range(n, 0, -1):
    if число % 2 == 0:
        print(число)







#6 завдання






n = int(input("Введи число: "))
факторіал = 1

for число in range(1, n + 1):
    факторіал *= число

print(f"Факторіал числа {n} дорівнює {факторіал}")







#7  завдання





бали = int(input("Введи кількість балів: "))

if 0 <= бали <= 49:
    print("незадовільно")
elif бали <= 69:
    print("задовільно")
elif бали <= 89:
    print("добре")
elif бали <= 100:
    print("відмінно")
else:
    print("Введи число від 0 до 100")







#8 завдання






a = float(input("Введи перше число: "))
b = float(input("Введи друге число: "))
дія = input("Введи дію (+, -, *, /): ")

if дія == "+":
    результат = a + b
elif дія == "-":
    результат = a - b
elif дія == "*":
    результат = a * b
elif дія == "/":
    if b == 0:
        print("Ділення на нуль")
        результат = None
    else:
        результат = a / b
else:
    print("Невідома дія")
    результат = None

if результат is not None:
    print("Результат:", результат)